## Staging: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 1 to change, 4 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                              NAME                              |
|--------|----------------------------------------------------------------|
| add    | `aws_iam_instance_profile.xray_daemon_instance_profile`        |
|        | `aws_iam_role.xray_daemon_role`                                |
|        | `aws_iam_role_policy_attachment.xray_daemon_policy_attachment` |
| delete | `aws_iam_instance_profile.nodes_k8s_instance_profile`          |
|        | `aws_iam_policy.xray_policy`                                   |
|        | `aws_iam_role.nodes_k8s_role`                                  |
|        | `aws_iam_role_policy_attachment.attach_xray_policy`            |
| update | `aws_kinesis_firehose_delivery_stream.firehose-waf-logs`       |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_iam_instance_profile.nodes_k8s_instance_profile will be destroyed
  # (because aws_iam_instance_profile.nodes_k8s_instance_profile is not in configuration)
  - resource "aws_iam_instance_profile" "nodes_k8s_instance_profile" {
      - arn         = "arn:aws:iam::239043911459:instance-profile/nodes.k8s.cluster.local" -> null
      - create_date = "2024-07-26T16:18:54Z" -> null
      - id          = "nodes.k8s.cluster.local" -> null
      - name        = "nodes.k8s.cluster.local" -> null
      - path        = "/" -> null
      - role        = "nodes.k8s.cluster.local" -> null
      - tags        = {} -> null
      - tags_all    = {} -> null
      - unique_id   = "AIPATPKBAT4R6GYEOVJX2" -> null
    }

  # aws_iam_instance_profile.xray_daemon_instance_profile will be created
  + resource "aws_iam_instance_profile" "xray_daemon_instance_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "xray-daemon-instance-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "xray-daemon-role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_policy.xray_policy will be destroyed
  # (because aws_iam_policy.xray_policy is not in configuration)
  - resource "aws_iam_policy" "xray_policy" {
      - arn              = "arn:aws:iam::239043911459:policy/XRayPolicy" -> null
      - attachment_count = 1 -> null
      - description      = "Policy to allow XRay tracing" -> null
      - id               = "arn:aws:iam::239043911459:policy/XRayPolicy" -> null
      - name             = "XRayPolicy" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "xray:PutTraceSegments",
                          - "xray:PutTelemetryRecords",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:iam::239043911459:instance-profile/nodes.k8s.cluster.local",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPATPKBAT4RVKJTR6HFO" -> null
      - tags             = {} -> null
      - tags_all         = {} -> null
    }

  # aws_iam_role.nodes_k8s_role will be destroyed
  # (because aws_iam_role.nodes_k8s_role is not in configuration)
  - resource "aws_iam_role" "nodes_k8s_role" {
      - arn                   = "arn:aws:iam::239043911459:role/nodes.k8s.cluster.local" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-07-26T16:18:54Z" -> null
      - force_detach_policies = false -> null
      - id                    = "nodes.k8s.cluster.local" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "nodes.k8s.cluster.local" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROATPKBAT4RYIQ3C7OG2" -> null
    }

  # aws_iam_role.xray_daemon_role will be created
  + resource "aws_iam_role" "xray_daemon_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "xray-daemon-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "xray-daemon-role"
        }
      + tags_all              = {
          + "Name" = "xray-daemon-role"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.attach_xray_policy will be destroyed
  # (because aws_iam_role_policy_attachment.attach_xray_policy is not in configuration)
  - resource "aws_iam_role_policy_attachment" "attach_xray_policy" {
      - id         = "eks-worker-role-20240726143605747600000001" -> null
      - policy_arn = "arn:aws:iam::239043911459:policy/XRayPolicy" -> null
      - role       = "eks-worker-role" -> null
    }

  # aws_iam_role_policy_attachment.xray_daemon_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "xray_daemon_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSXRayDaemonWriteAccess"
      + role       = "xray-daemon-role"
    }

  # aws_kinesis_firehose_delivery_stream.firehose-waf-logs will be updated in-place
  ~ resource "aws_kinesis_firehose_delivery_stream" "firehose-waf-logs" {
        id             = "arn:aws:firehose:ca-central-1:239043911459:deliverystream/aws-waf-logs-notification-canada-ca-waf"
        name           = "aws-waf-logs-notification-canada-ca-waf"
        tags           = {
            "CostCenter" = "notification-canada-ca-staging"
            "Terraform"  = "true"
        }
        # (5 unchanged attributes hidden)

      ~ extended_s3_configuration {
          + custom_time_zone   = "UTC"
            # (7 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 1 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.celery-error[0]"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.scanfiles-timeout[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.internal_alb_tls"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.internal_nginx_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-evicted-pods[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning[0]"]
WARN - plan.json - main -...
```

</details>
